IDEA StatiCa Open Model
EdgePositionType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Position of reinforcement on edge
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum EdgePositionType
Public Enumeration EdgePositionType
public enum class EdgePositionType
Members
Member name | Value | Description
WholeLength | 0 |  WholeLength
PartEdgeFromBegin | 1 |  Part edge from beginning
PartEdgeFromEnd | 2 |  Part edge from end
PartEdgeToSegment | 3 |  Part edge to the end
See Also
Reference
IdeaRS.OpenModel.Detail Namespace